

insert into state (state_name)
values ('서울특별시'),('인천광역시'),('세종특별시'),('대전광역시'),('광주광역시'),('대구광역시'),('울산광역시'),
('부산광역시'),('경기도'),('강원도'),('충청북도'),('충청남도'),('경상북도'),
('경상남도'),('전라남도'),('전라북도'),('제주특별자치도');


insert into city (state_id, city_name)
values (1, '종로구'),(1, '중구'),(1, '용산구'),(1, '성동구'),(1, '광진구'),(1, '동대문구'),(1, '중랑구'),
(1, '성북구'),(1, '강북구'),(1, '도봉구'),(1, '노원구'),(1, '도봉구'),(1, '노원구'),
(1, '은평구'),(1, '서대문구'),(1, '마포구'),(1, '양천구'),(1, '강서구'),(1, '구로구'),(1, '금천구'),(1, '영등포구'),(1, '동작구'),(1, '관악구')
,(1, '서초구'),(1, '강남구'),(1, '송파구'),(1, '강동구');

insert into city (state_id, city_name)
values (2, '중구'),
(2, '동구'),
(2, '미추홀구'),
(2, '연수구'),
(2, '남동구'),
(2, '부평구'),
(2, '계양구'),
(2, '서구'),
(2, '강화군'),
(2, '옹진군');


insert into city (state_id, city_name)
values (3, '조치원읍'),
(3, '연기면'),
(3, '연동면'),
(3, '부강면'),
(3, '금남면'),
(3, '장군면'),
(3, '연서면'),
(3, '전의면'),
(3, '전동면'),
(3, '소정면'),
(3, '한솔동'),
(3, '새롬동'),
(3, '나성동'),
(3, '도담동'),
(3, '어진동'),
(3, '해밀동'),
(3, '아름동'),
(3, '종촌동'),
(3, '고운동'),
(3, '소담동'),
(3, '반곡동'),
(3, '보람동'),
(3, '대평동'),
(3, '다정동');


insert into city (state_id, city_name)
values (4, '동구'),
(4, '중구'),
(4, '서구'),
(4, '유성구'),
(4, '대덕구');

insert into city (state_id, city_name)
values (5, '동구'),
(5, '서구'),
(5, '남구'),
(5, '북구'),
(5, '광산구');




insert into city (state_id, city_name)
values (6, '중구'),
(6, '동구'),
(6, '서구'),
(6, '남구'),
(6, '북구'),
(6, '수성구'),
(6, '달서구'),
(6, '달성군'),
(6, '군위군');

insert into city (state_id, city_name)
values (7, '중구'),
(7, '남구'),
(7, '동구'),
(7, '북구'),
(7, '울주군');



insert into city (state_id, city_name)
values (8, '중구'),
(8, '서구'),
(8, '동구'),
(8, '영도구'),
(8, '부산진구'),
(8, '동래구'),
(8, '남구'),
(8, '북구'),
(8, '강서구'),
(8, '해운대구'),
(8, '사하구'),
(8, '금정구'),
(8, '연제구'),
(8, '수영구'),
(8, '사상구'),
(8, '기장군');

insert into city (state_id, city_name)
values (9, '수원시'),
(9, '용인시'),
(9, '고양시'),
(9, '성남시'),
(9, '화성시'),
(9, '부천시'),
(9, '남양주시'),
(9, '안산시'),
(9, '평택시'),
(9, '안양시'),
(9, '시흥시'),
(9, '파주시'),
(9, '김포시'),
(9, '의정부시'),
(9, '광주시'),
(9, '하남시'),
(9, '광명시'),
(9, '군포시'),
(9, '양주시'),
(9, '오산시'),
(9, '이천시'),
(9, '안성시'),
(9, '구리시'),
(9, '의왕시'),
(9, '포천시'),
(9, '여주시'),
(9, '동두천시'),
(9, '과천시'),
(9, '양평군'),
(9, '가평군'),
(9, '연천군');

insert into city (state_id, city_name)
values (10, '춘천시'),
(10, '원주시'),
(10, '강릉시'),
(10, '동해시'),
(10, '태백시'),
(10, '속초시'),
(10, '삼척시'),
(10, '홍천군'),
(10, '횡성군'),
(10, '영월군'),
(10, '평창군'),
(10, '정선군'),
(10, '철원군'),
(10, '화천군'),
(10, '양구군'),
(10, '인제군'),
(10, '고성군'),
(10, '양양군');

insert into city (state_id, city_name)
values (11, '청주시'),
(11, '충주시'),
(11, '제천시'),
(11, '보은군'),
(11, '옥천군'),
(11, '영동군'),
(11, '증평군'),
(11, '진천군'),
(11, '괴산군'),
(11, '음성군'),
(11, '단양군');

insert into city (state_id, city_name)
values (12, '천안시'),
(12, '공주시'),
(12, '보령시'),
(12, '아산시'),
(12, '서산시'),
(12, '논산시'),
(12, '계룡시'),
(12, '당진시'),
(12, '금산군'),
(12, '부여군'),
(12, '서천군'),
(12, '청양군'),
(12, '홍성군'),
(12, '예산군'),
(12, '태안군');
insert into city (state_id, city_name)
values (13, '포항시'),
(13, '경주시'),
(13, '김천시'),
(13, '안동시'),
(13, '구미시'),
(13, '영주시'),
(13, '영천시'),
(13, '상주시'),
(13, '문경시'),
(13, '경산시'),
(13, '의성군'),
(13, '청송군'),
(13, '영양군'),
(13, '영덕군'),
(13, '청도군'),
(13, '고령군'),
(13, '성주군'),
(13, '칠곡군'),
(13, '예천군'),
(13, '봉화군'),
(13, '울진군'),
(13, '울릉군');

insert into city (state_id, city_name)
values (14, '창원시'),
(14, '김해시'),
(14, '양산시'),
(14, '진주시'),
(14, '거제시'),
(14, '통영시'),
(14, '사천시'),
(14, '밀양시'),
(14, '함안군'),
(14, '거창군'),
(14, '창녕군'),
(14, '고성군'),
(14, '하동군'),
(14, '합천군'),
(14, '남해군'),
(14, '함양군'),
(14, '산청군'),
(14, '의령군');



insert into city (state_id, city_name)
values (15, '목포시'),
(15, '여수시'),
(15, '순천시'),
(15, '나주시'),
(15, '광양시'),
(15, '담양군'),
(15, '곡성군'),
(15, '구례군'),
(15, '고흥군'),
(15, '보성군'),
(15, '화순군'),
(15, '장흥군'),
(15, '강진군'),
(15, '해남군'),
(15, '영암군'),
(15, '무안군'),
(15, '함평군'),
(15, '영광군'),
(15, '장성군'),
(15, '완도군'),
(15, '진도군'),
(15, '신안군');


insert into city (state_id, city_name)
values (16, '전주시'),
(16, '익산시'),
(16, '군산시'),
(16, '정읍시'),
(16, '남원시'),
(16, '김제시'),
(16, '무주군'),
(16, '완주군'),
(16, '부안군'),
(16, '고창군'),
(16, '임실군'),
(16, '순창군'),
(16, '진안군'),
(16, '장수군');

insert into city (state_id, city_name)
values (17, '제주시'),
(17, '서귀포시');











